import styles from './index.less';


class ProtectPrivacy extends React.Component {
  constructor(props) {
    super(props);
    this.state = {};
  }
  render() {
    return (
      <div className={styles.protectPrivacy}>
        <h1>薄荷口腔隐私权保护协议</h1>
        <article>
          <section>
            <p>薄荷口腔尊重用户个人信息的保护，在用户使用平台服务时，我们将按照本协议收集、使用及共享用户的个人信息。
          本协议包含了我们收集、存储、使用、共享和保护用户的个人信息的协议，我们希望通过本协议向用户清晰地介绍我们对用户个人信息的处理方式，
          因此我们建议用户完整地阅读本隐私权保护协议，以帮助用户了解维护自己隐私权的方式。如果用户不同意本隐私权保护协议任何内容，
          用户应立即停止使用薄荷口腔提供的服务。当用户使用薄荷口腔提供的服务时，即表示用户已同意我们按照本隐私权保护协议来合法收集、存储、使用、
          共享和保护用户的个人信息。
            </p>
          </section>
          <section>
            <h2>1. 适用范围</h2>
            <p>1.1本隐私权保护协议适用于薄荷口腔提供的所有服务，用户访问薄荷口腔微信及/或登陆相关客户端使用薄荷口腔提供的服务，均适用本隐私权保护协议。</p>
          </section>

          <section>
            <h2>2. 我们如何收集信息</h2>
            <p>我们收集信息是为了向用户提供更好、更优、更个性化的服务，我们收集信息的方式如下：</p>
            <p>2.1用户向我们提供的信息。包括用户注册薄荷口腔账户及用户在使用薄荷口腔提供的相关服务时填写及/或提交的信息，其中可能包括用户的姓名、
          性别、出生年月日、身份证号码、电话号码、电子邮箱、地址、支付宝账号及相关附加信息（如用户所在的省份和城市、邮政编码等）。
        </p>
            <p>2.2在用户使用服务过程中收集的信息。为了提供并优化用户需要的服务，我们会收集用户使用服务的相关信息，这类信息包括：</p>
            <p>在用户使用薄荷口腔服务，或访问薄荷口腔微信时，薄荷口腔自动接收并记录的用户的浏览器和计算机上的信息，包括但不限于用户的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及用户需求的网页记录等数据；如用户下载或使用薄荷口腔或其关联公司客户端软件，或访问移动网页使用薄荷口腔服务时，
          薄荷口腔可能会读取与用户位置和移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。
        </p>
            <p>2.3 用户通过薄荷口腔平台向第三方提供或向第三方披露的个人信息。</p>
            <p>2.4除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而收集用户的其他信息，包括用户与我们的客户服务团队联系时用户提供的相关信息，用户参与问卷调查时向我们发送的问卷答复信息，以及用户与薄荷口腔的关联方、合作伙伴之间互动时我们收集的相关信息。与此同时，为提高用户使用薄荷口腔提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，
          我们可能会通过了解一些用户的网络使用习惯、用户常用的软件信息等手段来判断用户账户的风险，并可能会记录一些我们认为有风险的URL。
        </p>
          </section>
          <section>
            <h2>3. 用户了解并同意，以下信息不适用本隐私权保护协议：</h2>
            <p>3.1用户在使用薄荷口腔提供的搜索服务时输入的关键字信息；</p>
            <p>3.2在用户未选择“匿名购买”和/或“匿名评价”功能时（如有），薄荷口腔收集到的用户在薄荷口腔进行交易的有关数据，包括但不限于出价、成交信息及评价详情；</p>
            <p>3.3信用评价、违反法律规定或违反薄荷口腔规则的行为及薄荷口腔已对用户采取的措施；</p>
            <p>3.4应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息；</p>
            <p>3.5从用户的用户名或其它可披露资料分析得出的用户个人信息。</p>
          </section>

          <section>
            <h2>4. 我们如何使用信息</h2>
            <p>4.1因收集用户的信息是为了向用户提供服务及提升服务质量的目的，为了实现这一目的，用户同意且授权我们将用户的信息用于下列用途：</p>
            <p>4.1.1向用户提供用户使用的各项服务，并维护、改进这些服务。</p>
            <p>4.1.2向用户推荐用户可能感兴趣的内容，包括介绍、产品或服务推荐、促销优惠或者其他商业性短信息等。如用户不希望收到这些信息，
          可以按照薄荷口腔平台的相关提示，在设备上选择取消接收信息。
        </p>
            <p>
              4.1.3可披露或使用用户的个人信息用于识别和确认用户的身份，或解决争议，或有助于确保薄荷口腔安全，限制欺诈、非法或其他刑事犯罪活动。
          用户同意薄荷口腔可披露或使用用户的个人信息以保护用户的生命、财产之安全或为防止严重侵害他人之合法权益或为公共利益之需要。
        </p>

            <p>4.2当薄荷口腔被法律强制或依照政府或依权利人因识别涉嫌侵权行为人的要求而提供用户的信息时，
          薄荷口腔将善意地披露用户的资料。当薄荷口腔需要保护薄荷口腔、薄荷口腔的代理人、客户、用户和其他人的权益和财产，包括执行薄荷口腔的协.
        </p>
            <p>
              4.3用户同意如果薄荷口腔拟进行企业并购、重组、出售全部或部分股份和/或资产时，
          薄荷口腔有权在与前述交易的相关方签署保密协议的前提下向其披露用户的资料以协助薄荷口腔完成该等交易。
        </p>
            <p>
              4.4用户同意薄荷口腔可在对用户的数据及信息进行信息脱密处理的情况下，将该等信息用于制作及发布行业分析报告、行业交流及其他非营利性用途。
        </p>
          </section>

          <section>
            <h2>5. 其他</h2>
            <p>
              5.1隐私权保护协议修订。薄荷口腔可能不时按照法律法规、行业管理及平台经营与服务的需要修改本隐私权保护协议。本隐私权保护协议的所有修改，将通过平台公告、邮件通知等方式予以公示，并在公示后立即生效或在该等公示中指定的日期生效。如用户对隐私权保护协议的修订有异议，用户应立即停止对薄荷口腔服务的使用；
          若用户继续使用薄荷口腔的服务，即视为用户同意对本隐私权保护协议的修订并同意受其约束。
        </p>
            <p>
              5.2特殊免责。薄荷口腔采用行业标准惯例以保护用户的个人信息，但鉴于技术限制或不可抗力，薄荷口腔不能确保用户的全部私人通讯及其他个人信息不会通过本隐私权保护协议中未列明的途径泄露出去，对此，薄荷口腔不承担任何责任。
        </p>
            <p>5.3争议管辖。因本隐私权保护协议所引发的争议由薄荷口腔所在地法院管辖。</p>
          </section>
        </article>

      </div >
    );
  }
}

export default ProtectPrivacy;
